# GetEnumerator Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExternalApplicationArray..::..GetEnumerator Method
ExternalApplicationArray Class See Also
---
Retrieve a forward moving iterator to the array.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual IEnumerator GetEnumerator()
```

Visual Basic
---
```text
Public Overridable Function GetEnumerator As IEnumerator
```

Visual C++
---
```text
public:
virtual IEnumerator^ GetEnumerator()
```

# ### Return Value
Returns a forward moving iterator to the array.
# ### Implements
IEnumerable..::..GetEnumerator()()()()
# See Also
ExternalApplicationArray Class
Autodesk.Revit.UI Namespace